Autodesk.DesignScript.Geometry.GeometrySettings.GeometryFactoryFilePath
Provides information about where to load the geometry factory file

Autodesk.DesignScript.Geometry.GeometrySettings.PersistenceManagerFilePath
Provides information about where to load the persistence manager file