Autodesk.DesignScript.Geometry.GeometryData.#ctor(System.String,System.Object,Autodesk.DesignScript.Interfaces.IContextDataProvider)
true

Autodesk.DesignScript.Geometry.GeometryData.Name
true

Autodesk.DesignScript.Geometry.GeometryData.Data
true

Autodesk.DesignScript.Geometry.GeometryData.ContextProvider
true

Autodesk.DesignScript.Geometry.GeometryData.DataChanged
true