Autodesk.DesignScript.Geometry.TypeSpecificSerializers.RegisterSerializers``1(System.String,System.Func{Autodesk.DesignScript.Geometry.GeometryDataSerializer,Autodesk.DesignScript.Interfaces.IDesignScriptEntity})
true

Autodesk.DesignScript.Geometry.TypeSpecificSerializers.GetReader(System.String)
true

Autodesk.DesignScript.Geometry.TypeSpecificSerializers.WriteEntity(Autodesk.DesignScript.Interfaces.IDesignScriptEntity,System.String@)
Finds the underlying interface implementation type and uses appropriate
writer to serialize the given entity.
entity:
typeName: output type name
true
Returns: