Autodesk.DesignScript.Geometry.SerialDataReader.#ctor(System.Array)
true

Autodesk.DesignScript.Geometry.SerialDataReader.AddData(System.String,System.Object)
true

Autodesk.DesignScript.Geometry.SerialDataReader.GetData(System.String)
true

Autodesk.DesignScript.Geometry.SerialDataReader.GetEnumerator
true

Autodesk.DesignScript.Geometry.SerialDataReader.ToArray
true

Autodesk.DesignScript.Geometry.SerialDataReader.DoneReading
true