Autodesk.DesignScript.Geometry.GeometryDataSerializer.#ctor(System.Array)
To be used for reading/de-serializating data
data: Data to deserialize from
true

Autodesk.DesignScript.Geometry.GeometryDataSerializer.#ctor(System.Collections.Generic.Dictionary{System.String,System.Object})
To be used for reading/de-serializating parameterized data
data: Parameterized data to deserialize from
true

Autodesk.DesignScript.Geometry.GeometryDataSerializer.#ctor
To be used for serialization of data
true

Autodesk.DesignScript.Geometry.GeometryDataSerializer.WriteObject(System.String,System.Object)
true

Autodesk.DesignScript.Geometry.GeometryDataSerializer.WriteBoolean(System.String,System.Boolean)
true

Autodesk.DesignScript.Geometry.GeometryDataSerializer.WriteDouble(System.String,System.Double)
true

Autodesk.DesignScript.Geometry.GeometryDataSerializer.WriteInteger(System.String,System.Int32)
true

Autodesk.DesignScript.Geometry.GeometryDataSerializer.WriteString(System.String,System.String)
true

Autodesk.DesignScript.Geometry.GeometryDataSerializer.WriteEntity``1(``0)
true

Autodesk.DesignScript.Geometry.GeometryDataSerializer.WriteEntity(Autodesk.DesignScript.Interfaces.IDesignScriptEntity,System.String@)
Finds the underlying interface implementation type and uses appropriate
writer to serialize the given entity.
entity:
typeName: output type name
Returns:
true

Autodesk.DesignScript.Geometry.GeometryDataSerializer.CreateGeometryFromData(System.String,System.Array)
Creates geometry from given set of data
geomType: Geometry type
data: Collection of input data to create geometry from
Returns: Collection of Geometry created using the given data
true

Autodesk.DesignScript.Geometry.GeometryDataSerializer.ReadPoint
true

Autodesk.DesignScript.Geometry.GeometryDataSerializer.WriteObject(Autodesk.DesignScript.Interfaces.IPointEntity)
true

Autodesk.DesignScript.Geometry.GeometryDataSerializer.ReadVector
true

Autodesk.DesignScript.Geometry.GeometryDataSerializer.WriteObject(Autodesk.DesignScript.Interfaces.IVectorEntity)
true

Autodesk.DesignScript.Geometry.GeometryDataSerializer.ReadCoordinateSystem
true

Autodesk.DesignScript.Geometry.GeometryDataSerializer.WriteObject(Autodesk.DesignScript.Interfaces.ICoordinateSystemEntity)
true

Autodesk.DesignScript.Geometry.GeometryDataSerializer.ReadLine
true

Autodesk.DesignScript.Geometry.GeometryDataSerializer.WriteObject(Autodesk.DesignScript.Interfaces.ILineEntity)
true

Autodesk.DesignScript.Geometry.GeometryDataSerializer.ReadCircle
true

Autodesk.DesignScript.Geometry.GeometryDataSerializer.WriteObject(Autodesk.DesignScript.Interfaces.ICircleEntity)
true

Autodesk.DesignScript.Geometry.GeometryDataSerializer.ReadArc
true

Autodesk.DesignScript.Geometry.GeometryDataSerializer.WriteObject(Autodesk.DesignScript.Interfaces.IArcEntity)
true

Autodesk.DesignScript.Geometry.GeometryDataSerializer.ReadBSplineCurve
true

Autodesk.DesignScript.Geometry.GeometryDataSerializer.WriteObject(Autodesk.DesignScript.Interfaces.INurbsCurveEntity)
true

Autodesk.DesignScript.Geometry.GeometryDataSerializer.AddData(System.String,System.Object)
true

Autodesk.DesignScript.Geometry.GeometryDataSerializer.GetData(System.String)
true

Autodesk.DesignScript.Geometry.GeometryDataSerializer.ToArray
true

Autodesk.DesignScript.Geometry.GeometryDataSerializer.GetEnumerator
true

Autodesk.DesignScript.Geometry.GeometryDataSerializer.ToString
true

Autodesk.DesignScript.Geometry.GeometryDataSerializer.ToString(System.Collections.IEnumerable)
true

Autodesk.DesignScript.Geometry.GeometryDataSerializer.DoneReading
true