Autodesk.DesignScript.Geometry.Application.OnSuspendExecution(Autodesk.DesignScript.Interfaces.IExecutionSession)
true

Autodesk.DesignScript.Geometry.Application.OnResumeExecution(Autodesk.DesignScript.Interfaces.IExecutionSession)
true