Autodesk.DesignScript.Geometry.GeometryDataProvider.ImportData(System.Collections.Generic.Dictionary{System.String,System.Object})
true

Autodesk.DesignScript.Geometry.GeometryDataProvider.GetExpression(System.Collections.Generic.Dictionary{System.String,System.Object},System.String)
true

Autodesk.DesignScript.Geometry.GeometryDataProvider.Name
true